In [2]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [3]:
df["Category"] = ["A","B","C","A","B"]
df["Gender"] = ["F","M","F","M","F"]
df

      Name  Age Category Gender
0    Alice   25        A      F
1      Bob   30        B      M
2  Charlie   35        C      F
3    David   40        A      M
4      Eve   45        B      F

In [6]:
# 日付データの操作
df["Date"] = pd.to_datetime(["2022-01-02","2022-01-03","2022-01-04","2022-01-01","2022-01-01"])
df

      Name  Age Category Gender       Date
0    Alice   25        A      F 2022-01-02
1      Bob   30        B      M 2022-01-03
2  Charlie   35        C      F 2022-01-04
3    David   40        A      M 2022-01-01
4      Eve   45        B      F 2022-01-01

In [7]:
df.dtypes

Name                object
Age                  int64
Category            object
Gender              object
Date        datetime64[ns]
dtype: object

In [11]:
# 年度だけ取得可能
print(df["Date"].dt.year)

# 月だけ取得可能
print(df["Date"].dt.month)

# 日だけ取得可能
print(df["Date"].dt.day)

# 曜日だけ取得可能
print(df["Date"].dt.weekday)

0    2022
1    2022
2    2022
3    2022
4    2022
Name: Date, dtype: int32
0    1
1    1
2    1
3    1
4    1
Name: Date, dtype: int32
0    2
1    3
2    4
3    1
4    1
Name: Date, dtype: int32
0    6
1    0
2    1
3    5
4    5
Name: Date, dtype: int32